Repository: dinhtrungquocanh/HAHA-COFFEE-App
Catalog: HAHACOFFEE/CustomerViews/Localizable.xcstrings
Source language: vi
Languages: en

source: %lld Sản phẩm
en: %lld Product(s)

source: Admin: Phuong An
en: Admin: Phương An

source: BÁN CHẠY NHẤT ✨
en: BESTSELLERS ✨

source: Bạn chưa có tài khoản?
en: Yet to sign-up?

source: Bạn chưa đăng nhập.
en: You haven’t logged in.

source: Bạn có chắc chắn muốn hủy đơn hàng này không?
en: Are you sure you want to delete this order?

source: Bạn có chắc muốn xóa sản phẩm này không?
en: Are you sure you want to delete this product?

source: Bạn đã có tài khoản?
en: Already have an account?

source: Bạn muốn đăng ký trở thành:
en: You want to sign up as:

source: Bản quyền © HAHA Coffee. Mọi quyền được bảo lưu.
en: Copyright © HAHA Coffee All Rights Reserved.

source: Bạn uống gì?
en: What's your sip?

source: BESTSELLERS ✨
en: BÁN CHẠY NHẤT ✨

source: Biển số xe: %@
en: License Plate:

source: CÀ PHÊ
en: COFFEE

source: Chào mừng, Shipper!
en: Welcome, Shipper!

source: Chi tiết đơn hàng
en: Order Details

source: Chọn địa chỉ
en: Choose your address

source: Chọn địa chỉ lấy hàng:
en: choose your pick-up location

source: Chọn mức đá
en: Choose ice level

source: Chọn mức đường
en: Choose sugar level

source: Chọn ngôn ngữ
en: Choose your language

source: Chương trình bắt đầu từ ngày 01/09 đến hết ngày 30/09, quý khách tạo tại khoản HAHA Coffee sẽ được giảm 20% trên 1 đơn nước.
en: From 01/09 to 30/09, customers who create an account at HAHA Coffee will receive a 20% discount on one drink order.

source: Chương trình khuyến mãi tháng 9
en: September's Sales Event

source: Cỡ: %@
en: Size:

source: Đá bình thường
en: Regular ice

source: Đã giao
en: Shipped

source: Đá: %@
en: Ice:

source: Đăng ký
en: Sign up

source: Đăng nhập
en: Log in

source: Đăng nhập ngay
en: Log in now

source: Đăng Nhập/Đăng Ký
en: Sign-In/Sign-Up

source: Đang tải địa chỉ...
en: Address Loading…

source: Đang tải...
en: Loading…

source: Đang tìm sản phẩm...
en: Searching item…

source: Đăng xuất
en: Log Out

source: DÀNH CHO BẠN ✨
en: FOR YOU ✨

source: Danh sách đơn hàng
en: List Of Orders

source: Đặt hàng
en: Order

source: Địa chỉ giao hàng:
en: Delivery Address:

source: Đơn hàng của bạn
en: Your order

source: Đường: %@
en: Sugar:

source: EVENTS ✨
en: SỰ KIỆN ✨

source: FOR YOU ✨
en: DÀNH CHO BẠN ✨

source: FRUIT TEA
en: TRÀ TRÁI CÂY

source: Gần nhất: %@
en: Nearest:

source: Ghé lấy
en: Take-away

source: Giá: %lld VNĐ
en: Price:

source: Giao hàng
en: Delivery

source: GIAO HÀNG
en: DELIVERY

source: Giỏ hàng
en: Cart

source: Giỏ hàng của bạn trống
en: Your cart is currently empty

source: Giỏ hàng của bạn trống!
en: Your cart is currently empty!

source: HAHA đang tới rồi nè!
en: HAHA is on the way!

source: HAHA khao!
en: HAHA treat!

source: Hiện tất cả
en: Show All

source: Hình thức nhận hàng
en: Reception Method

source: Hình thức nhận hàng:
en: Reception Method:

source: Hủy
en: Cancel

source: Hủy đơn hàng
en: Cancel your order

source: Ít đá
en: Light ice

source: Ít ngọt
en: Less sweetness

source: Không đá
en: No ice

source: Không tìm thấy sản phẩm nào.
en: No item found

source: Không tìm thấy sản phẩm nào...
en: No item found…

source: Kích cỡ
en: Size

source: Kích cỡ: %@
en: Size:

# Kích cỡ: %@ | Đá: %@ | Đường: %@
source: Kích cỡ: %1$@ | Đá: %2$@ | Đường: %3$@
en: Size: %1$@ | Ice: %2$@ | Sugar: %3$@

source: LẤY TẬN NƠI
en: PICKUP

source: Lọc
en: Filter

source: Lọc theo
en: Filter by

source: Lọc theo loại nước
en: Filter by category

source: Lỗi Đăng Nhập
en: Log-in Error

source: Lượng đá: %@
en: Ice:

source: Lượng đường: %@
en: SugarL

source: Mã đơn: %@
en: Order’s ID:

source: MÓN NGON PHẢI THỬ ✨
en: MUST-TRY DELIGHT ✨

source: MUST-TRY DELIGHT✨
en: MÓN NGON PHẢI THỬ

source: Ngọt bình thường
en: Regular sweetness

source: Người nhận: %@
en: Recipient:

source: Nhập địa chỉ
en: Enter Address

source: Order ngay
en: Order now

source: Order ngay!
en: Order now!

source: Phương thức thanh toán:
en: Payment Method:

source: Phương tiện: %@
en: Vehicle:

source: Quay về trang chủ
en: Back to Home

source: Sản phẩm
en: Product(s)

source: Số điện thoại:
en: Phone Number:

source: Số lượng: %lld
en: Quantity: %lld

source: SỰ KIỆN
en: PROGRAMS

source: SỰ KIỆN ✨
en: PROGRAMS ✨

source: TẤT CẢ SẢN PHẨM
en: All Products

source: Tên khách hàng:
en: Customer Name:

source: Tên nước: %@
en: Drink Name:

source: Tên: %@
en: Name:

source: Thành phần: bột matcha, sữa, syrup vanilla, nước.
en: Ingredients: matcha powder, milk, vanilla syrup, water.

source: Thành phần: trà đen, cam vàng, đào ngâm, sả tươi, hạt chia, nước cốt chanh tươi, puree đào, đá.
en: Ingredients: black tea, Navel orange, peach halves in syrup, fresh lemongrass, chia seeds, lemon juice, peach puree, ice.

source: Thành phần: trà đen, chanh tươi, thiên thạch, đá.
en: Ingredients: black tea, fresh lemon, meteorite, ice.

source: Thành phố Thủ Đức
en: Thu Duc City

source: Thêm địa chỉ ngay
en: Add Address Now

source: Thêm vào giỏ hàng
en: Add to cart

source: Thời gian đặt: %@
en: Order’s Timestamp:

source: Thông tin cá nhân
en: Personal Infomation

source: Thông tin khách hàng:
en: Customer’s Information:

source: Thông tin Shipper:
en: Shipper’s information

source: Thông tin Shipper.
en: Shipper’s Information.

source: Thưởng thức vị Matcha Latte chuẩn chỉ, đem lại cảm giác dịu thanh, trải nghiệm ngay Mộc Cha Latte thật sự khó cưỡng.
en: Enjoy the authentic gentle flavor of Matcha Latte, try out our irresistible Mộccha Latte.

source: Tìm kiếm sản phẩm...
en: Search for items…

source: Tổng cộng:
en: Total:

source: Tổng cộng: %lld VNĐ
en: Total:

source: Trà Chanh Thái Dương
en: Sunshine Lemontea

source: Trà Đào Cam Sả-turn
en: Sả-turn Orange Peach Tea

source: Trà Đen Marschiato
en: Marschiato Black Tea

source: TRÀ SỮA
en: MILK TEA

source: TRÀ TRÁI CÂY
en: FRUIT TEA

source: Trạng thái: %@
en: Status:

source: Vị chua và ngọt dịu đến từ sự kết hợp của cam và đào, cộng hưởng với hương thơm của sả sẽ khiến để lại ấn tượng khó quên như chiếc vòng của sao Thổ.
en: The sour and subtle sweetness from the dynamic duo of orange and peach, combined with the gentle aroma of lemongrass, will leave you with an unforgettable experience—just like seeing Saturn's rings for the first time.

source: Vị Marschiato độc đáo duy nhất có tại HAHA Coffee khiến mọi khách hàng đều muốn ghé mua thêm lần nữa.
en: The unique Marschiato flavor, available only at HAHA Coffee, keeps our customers coming back for more.

source: VND %lld
en: VND

source: Xác nhận
en: Confirm

source: Xác nhận đơn hàng
en: Order confirmed

source: Xem giỏ hàng
en: View Cart

source: Xem thêm
en: More

source: Xem trạng thái Order
en: View Order Status

source: Xóa
en: Delete
